{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing three high‑confidence frontend tasks with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of all major frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying them globally.",
  "frontend/index.html": "Main HTML entry containing boot fallback UI, metadata, and styling for loading before React mounts.",
  "frontend/public/health.html": "Standalone health‑check page showing uptime status, build info, and basic diagnostic guidance.",
  "frontend/src/App.tsx": "App root that sets up theming, Web3 provider, error boundary, dashboard rendering, and dispatches a one‑time app‑mounted event.",
  "frontend/src/components/BalanceView.tsx": "Balance display component handling BNB and token balances, valuations, manual refresh, live updates, and metadata cache clearing.",
  "frontend/src/components/ContractInfo.tsx": "Displays vault contract details including address, owner, network info, and copy/BscScan links using data from useVaultInfo.",
  "frontend/src/components/DepositForm.tsx": "Form for depositing BNB or tokens into the vault with balance display, validation, transaction handling, and history logging.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build and environment info and provides copyable diagnostics and performance data for troubleshooting.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches application errors and renders a fallback UI with error details, recovery options, and troubleshooting tips.",
  "frontend/src/components/Footer.tsx": "Renders site footer with branding, build info, attribution, and a referral link.",
  "frontend/src/components/Header.tsx": "Top navigation header displaying app branding and a light/dark theme toggle.",
  "frontend/src/components/TokenSelectorInput.tsx": "Token input field supporting dropdown token selection or manual address entry, using saved token catalogs and watched tokens.",
  "frontend/src/components/TransactionHistory.tsx": "Renders a scrollable transaction history list with status icons, BscScan links, and a clear-history action.",
  "frontend/src/components/WalletConnect.tsx": "Handles wallet connection, network switching, initialization states, and mobile-specific instructions.",
  "frontend/src/components/WithdrawForm.tsx": "Provides BNB and token withdrawal forms, manages submission flow, errors, and logs transactions to history.",
  "frontend/src/global.d.ts": "Augments the Window type with Ethereum provider fields for MetaMask compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous Internet Computer actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices to compute USD and BNB valuations for balances with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, including login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating Web3 is used instead of IC backend queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent map of token addresses to labels using localStorage, providing CRUD helpers and fallback labels.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata (symbol, decimals, name) in localStorage with versioning and exposes get/set/clear helpers.",
  "frontend/src/hooks/useTxHistory.ts": "Stores and updates transaction history in localStorage with automatic polling to update pending transaction statuses.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and caches BNB and token balances from the vault with metadata lookup, polling, and timeout handling.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and exposes the vault owner address with loading and error state management.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal helpers that encode and send contract calls, tracking operation states.",
  "frontend/src/hooks/useWatchedTokens.ts": "Maintains a validated, normalized list of watched token addresses persisted in localStorage.",
  "frontend/src/hooks/useWeb3.tsx": "Provides a React context for wallet connection, chain switching, contract calls, and mobile/MetaMask detection.",
  "frontend/src/index.css": "Defines Tailwind base styles and a full light/dark mode color system using custom CSS variables.",
  "frontend/src/lib/appBranding.ts": "Holds app branding constants and helpers for names and identifiers.",
  "frontend/src/lib/buildInfo.ts": "Stores build version metadata and utilities to retrieve build identifiers from constants or meta tags.",
  "frontend/src/lib/contracts.ts": "Defines contract addresses, method signatures, and helpers for encoding and decoding EVM calls.",
  "frontend/src/lib/evm.ts": "Implements low-level EVM utilities for address validation and encoding/decoding uint256, addresses, and unit conversions.",
  "frontend/src/lib/evmAbiText.ts": "Provides ABI text decoding utilities for ERC‑20 metadata such as name and symbol.",
  "frontend/src/lib/performanceCheck.ts": "Collects build and performance timing data and formats it for display or export.",
  "frontend/src/lib/prices.ts": "Fetches BNB and token prices from CoinGecko and provides price formatting helpers.",
  "frontend/src/lib/utils.ts": "Exports a class name merging helper using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI handling wallet connection state, network checks, and vault balance views with tabs and forms.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Project state metadata describing issues, required fixes, and existing feature definitions for wallet connection and balance refresh."
}