{
  "backend/main.mo": "Minimal Motoko canister actor with no defined functions.",
  "feature_evidence.json": "Feature evidence report listing UI ZIP-export removal tasks and associated files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of multiple frontend source files.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme color variables and base element styling.",
  "frontend/index.html": "Main HTML entry with boot fallback loader, metadata, and app mount point.",
  "frontend/public/health.html": "Standalone health-check page showing service status, metadata, and guidance.",
  "frontend/src/App.tsx": "Root React component wiring theme, Web3 provider, header, dashboard, and app-mounted event dispatch.",
  "frontend/src/components/BalanceView.tsx": "Vault balance UI with refresh, live-update toggle, cache clearing, valuation display, and balances table.",
  "frontend/src/components/ContractInfo.tsx": "Displays vault contract details including address, owner, network info, and copy/BscScan link actions.",
  "frontend/src/components/DepositForm.tsx": "Handles depositing BNB or tokens into the vault with validation, transaction sending, and history logging.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build and environment info and provides buttons to copy diagnostics and performance data.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches runtime errors and renders a fallback UI with error details and recovery options.",
  "frontend/src/components/Footer.tsx": "Renders app footer showing branding, build metadata, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing branding, wallet connect, and a theme toggle.",
  "frontend/src/components/TokenSelectorInput.tsx": "Token address input supporting dropdown selection from saved tokens or manual entry.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a user's deposit and withdrawal history with status badges, links, and a clear-history option.",
  "frontend/src/components/VaultBalancesTable.tsx": "Shows vault token balances, including BNB and ERC‑20 tokens, with optional USD/BNB valuations and error states.",
  "frontend/src/components/WalletBalancesTable.tsx": "Renders connected wallet balances for BNB and tokens, including valuations and loading/error indicators.",
  "frontend/src/components/WalletBalancesView.tsx": "Provides controls for refreshing and toggling live updates, and displays wallet balances with valuation data.",
  "frontend/src/components/WalletConnect.tsx": "Handles wallet connection flow, network switching, initialization state, and mobile-specific messaging.",
  "frontend/src/components/WalletConnectTopBar.tsx": "Top-bar component showing wallet status with connect, switch network, and loading states.",
  "frontend/src/components/WithdrawForm.tsx": "UI form for withdrawing BNB or BEP20 tokens, handling validation, wallet checks, transaction calls, and history updates.",
  "frontend/src/global.d.ts": "Extends window typings to include Ethereum provider fields for MetaMask-style wallets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices to compute USD and BNB valuations for balances, with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, indicating Web3 is used instead of backend queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent localStorage-backed token catalog with labels, normalization, and dropdown helpers.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata in localStorage with versioning and provides get/set/clear utilities.",
  "frontend/src/hooks/useTxHistory.ts": "Manages local transaction history, persists it to localStorage, and polls the BSC network to update pending transaction statuses.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and polls BNB and token balances held by the vault with caching, fallbacks, and coalesced RPC calls.",
  "frontend/src/hooks/useVaultInfo.ts": "Loads the vault owner's address via a contract call and exposes loading and error state.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal functions for BNB and tokens, handling approvals and transaction sending.",
  "frontend/src/hooks/useWalletBalances.ts": "Fetches and polls the user’s wallet BNB and ERC‑20 balances with caching, timeout handling, and network checks.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent, validated list of watched token addresses stored in localStorage.",
  "frontend/src/hooks/useWeb3.tsx": "Provides Web3 context with wallet connection, chain switching, contract calls, transaction sending, and basic device detection.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, plus base element styling.",
  "frontend/src/lib/appBranding.ts": "Provides app branding constants and helpers for retrieving app name and identifier.",
  "frontend/src/lib/buildExport.ts": "Empty placeholder file for future build export utilities.",
  "frontend/src/lib/buildInfo.ts": "Defines build version metadata and functions to retrieve build identifiers, including from the DOM.",
  "frontend/src/lib/contracts.ts": "Implements contract interaction helpers including method encoding/decoding and stores known function signatures.",
  "frontend/src/lib/evm.ts": "Offers low-level EVM utilities for encoding/decoding uint256 and addresses, plus unit parsing/formatting.",
  "frontend/src/lib/evmAbiText.ts": "Provides ABI text-decoding helpers for ERC‑20 metadata such as name and symbol.",
  "frontend/src/lib/performanceCheck.ts": "Generates performance diagnostics including build info and browser timing data, with a formatter for export.",
  "frontend/src/lib/prices.ts": "Fetches token and BNB prices from CoinGecko and formats price values; includes known token ID mappings.",
  "frontend/src/lib/utils.ts": "Exports a class name merging helper using clsx and tailwind-merge.",
  "frontend/src/lib/zipWriter.ts": "Empty placeholder file for future ZIP writing utilities.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with providers, and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that manages wallet connection state, shows balances, and provides deposit/withdraw tabs for vault operations on BSC.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "JSON metadata describing project state, existing features, and a pending request to remove ZIP output from the build."
}