{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing branding‑related fixes, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries for major frontend files describing their roles in the app.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme color variables and base styles.",
  "frontend/index.html": "Main HTML entry with metadata, branding title, and a styled boot fallback loader screen.",
  "frontend/public/health.html": "Standalone health check page showing app status and environment details with styled layout.",
  "frontend/src/App.tsx": "Root React component initializing themes, Web3, error boundary, and rendering the dashboard.",
  "frontend/src/components/BalanceView.tsx": "UI component showing BNB and token balances with refresh, valuations, caching, and live update controls.",
  "frontend/src/components/ContractInfo.tsx": "Displays contract address, owner, and network info with copy-to-clipboard and BscScan link, using vault info hook.",
  "frontend/src/components/DepositForm.tsx": "Provides token deposit UI with validation, network checks, vault balance display, and transaction history integration.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build details and allows copying diagnostics and performance check data for debugging.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches rendering errors and displays a recovery screen with reload option and optional technical details.",
  "frontend/src/components/Footer.tsx": "Renders app footer with branding, build version, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Top navigation header showing branding and a theme toggle button.",
  "frontend/src/components/TokenSelectorInput.tsx": "Reusable token selector enabling dropdown selection or manual address entry with validation support.",
  "frontend/src/components/TransactionHistory.tsx": "UI component displaying deposit and withdrawal history with status icons, hash/address shortening, and ability to clear stored history.",
  "frontend/src/components/WalletConnect.tsx": "Handles wallet connection flow with MetaMask checks, network switching, and mobile/desktop fallback instructions.",
  "frontend/src/components/WithdrawForm.tsx": "Form for withdrawing BNB or tokens, validating inputs, submitting transactions, and recording entries in transaction history.",
  "frontend/src/global.d.ts": "Extends Window type to include Ethereum provider fields used by MetaMask.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous IC actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices and computes USD/BNB valuations for balances with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login/logout, and managing AuthClient state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module indicating Web3 is used instead of IC queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent token catalog in localStorage, allowing label setting, removal, retrieval, and dropdown option generation using normalized addresses.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata (symbol, decimals, name) in localStorage with versioning, providing get/set/clear operations.",
  "frontend/src/hooks/useTxHistory.ts": "Stores and updates transaction history with localStorage persistence and polling for receipt status via provider or RPC.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and tracks vault BNB and ERC-20 balances with metadata caching, polling, error handling, and formatted output.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and exposes the vault owner address using contract calls with loading and error state tracking.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal operations for tokens and BNB, handling approvals and transaction execution.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a normalized list of watched token addresses with validation and localStorage persistence.",
  "frontend/src/hooks/useWeb3.tsx": "React Web3 context providing wallet connection, chain switching, contract calls, and MetaMask/mobile detection for BSC.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light/dark color palettes, accessibility rules, and mobile touch utilities.",
  "frontend/src/lib/appBranding.ts": "Centralized branding constants and helpers for app name, identifier, and tagline.",
  "frontend/src/lib/buildInfo.ts": "Exposes static build metadata and utilities to retrieve version, date, and deployed build ID.",
  "frontend/src/lib/contracts.ts": "Defines contract addresses, function signatures, and helpers for encoding and decoding EVM contract calls.",
  "frontend/src/lib/evm.ts": "Provides BigInt‑based EVM encoding/decoding utilities for addresses, uint256, and unit formatting.",
  "frontend/src/lib/evmAbiText.ts": "Decodes ABI‑encoded ERC‑20 string metadata such as symbol and name using browser‑safe UTF‑8 parsing.",
  "frontend/src/lib/performanceCheck.ts": "Collects build and performance timing data and formats it for diagnostics or clipboard export.",
  "frontend/src/lib/prices.ts": "Utility for fetching BNB and known token prices from CoinGecko and formatting price values.",
  "frontend/src/lib/utils.ts": "Provides a helper function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page handling wallet connection, network checks, balance display, and deposit/withdraw operations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project state metadata tracking features, issues, and naming regression related to app identifiers."
}