{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated textual summaries of all major frontend files for reference.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme color variables and base layout rules.",
  "frontend/index.html": "Main HTML shell including boot fallback loader, metadata, and mount point for the frontend app.",
  "frontend/public/health.html": "Standalone health‑check page showing system status, environment info, and guidance.",
  "frontend/src/App.tsx": "Root React component wiring ThemeProvider, Web3Provider, ErrorBoundary, and Dashboard, and dispatching an app-mounted event.",
  "frontend/src/components/BalanceView.tsx": "Displays BNB and token balances with refresh, live update toggling, error handling, and valuation integration.",
  "frontend/src/components/ContractInfo.tsx": "Displays contract address, owner address, and BSC network info with clipboard copy actions and loading states.",
  "frontend/src/components/DepositForm.tsx": "Handles BNB and token deposits into the vault, including validation, transaction sending, and history logging.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build and environment info with options to copy diagnostics and performance data to clipboard.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches runtime errors and renders a fallback UI with error details and recovery actions.",
  "frontend/src/components/Footer.tsx": "Renders footer with branding, build version, and Caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Displays app branding and provides a theme toggle button.",
  "frontend/src/components/TokenSelectorInput.tsx": "Provides a token selector or manual entry field using saved token catalogs and popover search.",
  "frontend/src/components/TransactionHistory.tsx": "UI component that displays, formats, and clears stored transaction history with status icons and BscScan links.",
  "frontend/src/components/WalletConnect.tsx": "Wallet connection UI handling MetaMask availability, network switching, and mobile/desktop fallback instructions.",
  "frontend/src/components/WithdrawForm.tsx": "Form for withdrawing BNB or tokens from the vault, validating input, executing withdrawals, and logging history entries.",
  "frontend/src/global.d.ts": "Type declaration extending the Window object with Ethereum provider fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous IC actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices and computes USD/BNB valuations for on-chain balances.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, persistence, and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that Web3 replaces backend queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent map of token addresses to user-defined labels using localStorage, with normalization and fallback display labels. Provides methods to set, remove, and retrieve labels plus dropdown option formatting.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata (symbol, decimals, name) in localStorage with versioning. Supports get/set, clearing entries, and automatic persistence.",
  "frontend/src/hooks/useTxHistory.ts": "Stores transaction history in localStorage and polls BSC RPC or provider for receipt updates. Supports adding entries, clearing history, and tracking pending statuses.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and caches BNB and token balances from the vault with polling, timeout protection, and metadata retrieval. Manages balance state, errors, and live updates for watched tokens.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and stores the vault owner address using contract calls. Exposes loading, error state, and a refetch function.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal operations for tokens and BNB by constructing and sending encoded contract calls. Tracks deposit/withdraw action state.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent list of normalized watched token addresses in localStorage with validation. Supports adding, removing, and checking tokens.",
  "frontend/src/hooks/useWeb3.tsx": "Provides a React context for Web3 state, wallet connection, BSC network switching, and contract interaction helpers.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive light/dark theme CSS variables for the app’s color system.",
  "frontend/src/lib/appBranding.ts": "Exports app branding constants and helpers for retrieving app names and identifiers.",
  "frontend/src/lib/buildInfo.ts": "Stores static build metadata and utilities to retrieve version, date, and deployed build ID.",
  "frontend/src/lib/contracts.ts": "Contains contract address, function signatures, and utilities for encoding and decoding EVM contract calls.",
  "frontend/src/lib/evm.ts": "Implements low-level EVM helpers for address validation, ABI encoding/decoding, and unit conversion.",
  "frontend/src/lib/evmAbiText.ts": "Provides browser‑safe ABI string decoding utilities for ERC‑20 metadata like symbol and name.",
  "frontend/src/lib/performanceCheck.ts": "Collects build and browser performance metrics and formats them for display or export.",
  "frontend/src/lib/prices.ts": "Fetches BNB and token prices from CoinGecko and formats numeric price values.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with wallet connection handling, balance views, and deposit/withdraw operations gated by BSC network status.",
  "frontend/tailwind.config.js": "Defines Tailwind configuration with custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, known issues, and feature requirements related to wallet connection visibility and fixing stuck balance refresh behavior."
}