{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme color tokens and base elements.",
  "frontend/index.html": "HTML entry point with boot fallback UI and metadata for the Digital Asset Vault app.",
  "frontend/public/health.html": "Standalone health check page with styled system status and environment details.",
  "frontend/src/App.tsx": "Main app component wiring providers, header, and dashboard, dispatching an app-mounted event once.",
  "frontend/src/components/BalanceView.tsx": "Balance display component with manual refresh, live update toggle, metadata cache clearing, and token table rendering.",
  "frontend/src/components/ContractInfo.tsx": "Displays contract address, owner info, and network details with copy-to-clipboard and BscScan link.",
  "frontend/src/components/DepositForm.tsx": "Provides UI and logic for depositing BNB or tokens into the vault and logs transactions.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build and environment info and allows copying diagnostics and performance data.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches and displays application errors with reload and troubleshooting options.",
  "frontend/src/components/Footer.tsx": "Renders footer with branding, build metadata, and attribution links.",
  "frontend/src/components/Header.tsx": "Displays app branding, wallet connect bar, and theme toggle in the top header.",
  "frontend/src/components/TokenSelectorInput.tsx": "Lets users select or manually enter a token address with dropdown search and manual mode.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a scrollable transaction history with status badges, hash/address shortening, and a clear-history option using useTxHistory.",
  "frontend/src/components/VaultBalancesTable.tsx": "Renders BNB and token balances with optional USD/BNB valuations and loading states.",
  "frontend/src/components/WalletConnect.tsx": "Manages wallet connection flow, network switching, mobile instructions, and initialization states using useWeb3.",
  "frontend/src/components/WalletConnectTopBar.tsx": "Top-bar wallet status component showing connection, network state, and actions to connect or switch networks.",
  "frontend/src/components/WithdrawForm.tsx": "Withdrawal form for BNB and tokens with validation, transaction initiation, history logging, and balance display.",
  "frontend/src/global.d.ts": "Extends Window typing to include Ethereum provider fields for MetaMask compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices to compute USD and BNB valuations for balances, with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handlers, and manages identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because Web3 is used instead of IC backend queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent token catalog in localStorage with label editing, removal, and dropdown option generation.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata in localStorage with get/set/clear operations to reduce repeated RPC calls.",
  "frontend/src/hooks/useTxHistory.ts": "Stores and updates local transaction history and polls for receipt confirmations via provider or RPC.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches vault BNB and token balances with metadata caching, timeouts, fallback behavior, and optional polling.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and exposes the vault owner address with loading and error state management.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal functions for interacting with the vault contract, tracking loading states and encoding transactions.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent, validated list of token addresses using localStorage with add, remove, and lookup utilities.",
  "frontend/src/hooks/useWeb3.tsx": "Implements a Web3 context for wallet connection, network switching, contract calls, and tracking connection state.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and color variables for light and dark themes.",
  "frontend/src/lib/appBranding.ts": "Exports app branding constants including names, tagline, identifier, and helpers to get them.",
  "frontend/src/lib/buildInfo.ts": "Stores build version metadata and utilities for retrieving build identifiers and deployed build info.",
  "frontend/src/lib/contracts.ts": "Provides vault contract address, method signatures, and utilities for encoding and decoding contract calls.",
  "frontend/src/lib/evm.ts": "Supplies EVM utilities for address validation, ABI encoding/decoding, and unit conversions using BigInt.",
  "frontend/src/lib/evmAbiText.ts": "Implements ABI text decoding helpers for ERC‑20 metadata such as symbol and name.",
  "frontend/src/lib/performanceCheck.ts": "Collects build and browser timing data and formats it into a readable performance report.",
  "frontend/src/lib/prices.ts": "Fetches BNB and token prices from CoinGecko and provides formatting utilities for displaying prices.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with React Query and Internet Identity providers, and renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with wallet connection logic, network checks, balances, and deposit/withdraw UI.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and theme settings for the project.",
  "project_state.json": "Describes the current project state, issues, and feature requests related to balance fetching and UI layout."
}