{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Aggregates feature evidence linking features to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Lists concise summaries of many frontend files including components, hooks, and pages.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point with metadata, branding, and a styled boot fallback loader.",
  "frontend/src/App.tsx": "Wraps Dashboard with theme, Web3 provider, error boundary, and notification toaster.",
  "frontend/src/components/BalanceView.tsx": "Displays vault BNB/token balances with valuation, watched-token management, refresh, and live-update controls.",
  "frontend/src/components/ContractInfo.tsx": "Shows vault contract address, owner address, and BSC network info with copy and BscScan links.",
  "frontend/src/components/DepositForm.tsx": "Deposit form allowing token selection, amount input, validation, and transaction submission with history logging and balance display.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches render errors and displays a fallback UI with reload and optional technical details.",
  "frontend/src/components/Footer.tsx": "Footer showing attribution, build version, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with app branding and a theme toggle button.",
  "frontend/src/components/TokenSelectorInput.tsx": "Reusable token selector supporting dropdown of saved tokens and manual address input with validation.",
  "frontend/src/components/TransactionHistory.tsx": "Component displaying stored transaction history with statuses, links, and a clear-history option.",
  "frontend/src/components/WalletConnect.tsx": "Wallet connection UI handling MetaMask availability, network checks, and mobile/desktop-specific instructions.",
  "frontend/src/components/WithdrawForm.tsx": "React component handling BNB and token withdrawals with validation, transaction submission, and history logging.",
  "frontend/src/global.d.ts": "Extends Window to type the ethereum provider interface for MetaMask-like wallets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using react-query and invalidates dependent queries on change.",
  "frontend/src/hooks/useBalanceValuations.ts": "Computes USD and BNB valuations for BNB and token balances by fetching prices and formatting results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are handled via Web3 instead of backend.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent token catalog with labels in localStorage, providing lookup, modification, and dropdown option helpers.",
  "frontend/src/hooks/useTxHistory.ts": "Stores transaction history in localStorage, polls for receipt updates, and exposes functions to add or clear entries.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and tracks BNB and ERC20 token balances for the vault with fallback, polling, and per‑token error handling.",
  "frontend/src/hooks/useVaultInfo.ts": "Loads and exposes the vault owner address with simple loading and error state management.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal operations for BNB and tokens, including approvals and transaction handling.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent, validated list of watched token addresses using localStorage.",
  "frontend/src/hooks/useWeb3.tsx": "Creates a Web3 context handling wallet connection, network switching, contract calls, and transactions.",
  "frontend/src/index.css": "Defines Tailwind‑based global styles including color themes, dark mode, accessibility, and layout utilities.",
  "frontend/src/lib/buildInfo.ts": "Exports build metadata and helpers to retrieve the current build version, date, and identifier.",
  "frontend/src/lib/contracts.ts": "Provides helpers for encoding and decoding contract calls and defines vault‑related function signatures.",
  "frontend/src/lib/evm.ts": "Provides bigint-based helpers for validating Ethereum addresses and encoding/decoding uint256 and address values, plus unit parsing/formatting utilities.",
  "frontend/src/lib/prices.ts": "Fetches token and BNB prices from CoinGecko, maps known token addresses to IDs, and formats prices for display.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and mounts the root component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI, handling wallet connection state, network checks, vault balance access, and tabbed deposit/withdraw views with loading states.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and content paths for the project.",
  "project_state.json": "Describes the project's overall state, goals, architecture notes, known issues, and existing feature requirements."
}