{
  "backend/main.mo": "Empty Motoko actor with no functions or state.",
  "feature_evidence.json": "Feature evidence report describing two features related to Web3Provider wrapping and error fallback, including affected files and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend source file paths to short functional summaries of each component, hook, and utility.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH‑based color variables and light/dark theme styles.",
  "frontend/index.html": "HTML entry point setting metadata and loading the React application root and main module.",
  "frontend/src/App.tsx": "Main React app wrapper adding ThemeProvider, Web3Provider, ErrorBoundary, Dashboard, and Toaster.",
  "frontend/src/components/BalanceView.tsx": "Component displaying BNB and token balances with refresh actions and a UI for adding/removing watched token addresses.",
  "frontend/src/components/ContractInfo.tsx": "Component showing vault contract address, owner, network info, and clipboard/copy actions.",
  "frontend/src/components/DepositForm.tsx": "Form for depositing BEP20 tokens, including validation, approval+deposit flow, and status feedback.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches runtime errors and displays a styled fallback UI with reload and technical details options.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header bar with branding and a theme toggle button using next-themes.",
  "frontend/src/components/WalletConnect.tsx": "Handles MetaMask detection, wallet connection, network switching, and mobile/desktop fallback instructions for Web3.",
  "frontend/src/components/WithdrawForm.tsx": "Form UI for withdrawing BNB or BEP20 tokens, including validation and calling vault withdrawal hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth client state, login handling, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because Web3 is used directly instead of backend queries.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and formats BNB and token balances from the vault contract, updating when tokens or connection state change.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and tracks the vault owner address from the contract when Web3 is connected.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal helpers that encode contract calls and manage loading state while sending transactions to the vault.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent list of watched token addresses using localStorage with add, remove, and lookup helpers.",
  "frontend/src/hooks/useWeb3.tsx": "Implements a Web3 context for MetaMask-based wallet connection, network switching, and contract call/transaction utilities.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with accessibility and mobile tweaks.",
  "frontend/src/lib/contracts.ts": "Contains vault address, function signatures, and helpers to encode and decode contract method calls.",
  "frontend/src/lib/evm.ts": "Implements BigInt-based EVM utilities for address validation, encoding/decoding, and unit parsing/formatting without external libraries.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard UI with wallet connection, network checks, and tabs for balances, deposits, and withdrawals.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the DApp’s goals, requirements, known issues, and features for interacting with a BSC vault contract."
}