{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains pre-generated summaries for all frontend source files used in the app.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark mode with OKLCH color system and global styles.",
  "frontend/index.html": "HTML entry file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Initializes theme, Web3 provider, error boundary, dashboard, and global Toaster notifications.",
  "frontend/src/components/BalanceView.tsx": "Displays BNB and token balances with refresh, watched-token management, valuations, and read‑only or wrong‑network alerts.",
  "frontend/src/components/ContractInfo.tsx": "Shows vault contract details, owner address, network info, and provides clipboard copy and BscScan link actions.",
  "frontend/src/components/DepositForm.tsx": "BNB balance display and token deposit form with validation, token selector, and deposit execution via vault operations.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a detailed error card with reload option and optional stack trace.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation header with app title and a theme toggle button using next-themes.",
  "frontend/src/components/TokenSelectorInput.tsx": "Token selection input supporting dropdown selection, manual entry, and address validation.",
  "frontend/src/components/WalletConnect.tsx": "Wallet connection component handling MetaMask presence, network switching, mobile guidance, and error states.",
  "frontend/src/components/WithdrawForm.tsx": "Form for withdrawing BNB or tokens from the vault with validation, token selection, and transaction handling.",
  "frontend/src/global.d.ts": "Extends the Window interface with Ethereum provider typings for MetaMask.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices to compute USD and BNB valuations for balances with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating Web3 is used instead of Internet Computer queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent token catalog with labels in localStorage, supporting add/update/remove and dropdown formatting.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches BNB and ERC‑20 token balances from the vault contract with per‑token error handling and formatting.",
  "frontend/src/hooks/useVaultInfo.ts": "Loads and exposes the vault owner address with loading and error state.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal actions for tokens and BNB using on‑chain contract calls with state flags.",
  "frontend/src/hooks/useWatchedTokens.ts": "Stores and validates a persistent list of watched token addresses using localStorage.",
  "frontend/src/hooks/useWeb3.tsx": "Implements a Web3 context for MetaMask/BSC connection, contract calls, transactions, and wallet state management.",
  "frontend/src/index.css": "Initializes Tailwind layers and defines light/dark theme CSS variables plus accessibility and mobile touch rules.",
  "frontend/src/lib/contracts.ts": "Provides contract method encoding/decoding helpers and known function signatures for interacting with a vault contract.",
  "frontend/src/lib/evm.ts": "Implements low-level EVM utilities for address validation and uint256 encoding/decoding, plus unit parsing/formatting.",
  "frontend/src/lib/prices.ts": "Fetches BNB and token prices from CoinGecko and formats prices for display.",
  "frontend/src/lib/utils.ts": "Exports a classnames utility combining clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard UI, handling wallet state, network checks, and tabbed views for balances, deposits, and withdrawals.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the current DApp build state, including goals, architectural notes, known issues, and existing feature specifications for a BSC vault dashboard."
}