{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "Lists implemented features with associated file paths, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for numerous frontend source files.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes with global styling.",
  "frontend/index.html": "HTML entry point with boot‑fallback UI and metadata for loading the frontend application.",
  "frontend/public/health.html": "Standalone health‑check page showing build info, system status, and guidance messaging.",
  "frontend/src/App.tsx": "Root React component wiring ThemeProvider, Web3Provider, layout structure, and dispatching an app-mounted event.",
  "frontend/src/components/AddCustomTokenForm.tsx": "Form component allowing users to add custom ERC‑20 tokens with metadata lookup, validation, and saving.",
  "frontend/src/components/BalanceView.tsx": "Displays vault balances with refresh controls, live update toggling, metadata cache management, and valuation data handling.",
  "frontend/src/components/BuildExportButton.tsx": "Provides a button to export the project as a ZIP file with progress messaging and toast notifications.",
  "frontend/src/components/ContractInfo.tsx": "Shows contract address, network details, and available smart‑contract functions with copy and BscScan link actions.",
  "frontend/src/components/DepositForm.tsx": "Handles depositing BNB or tokens into the vault, including validation, transactions, and history logging.",
  "frontend/src/components/DiagnosticsBar.tsx": "Displays build and environment info and allows copying diagnostics and performance data to the clipboard.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches runtime errors and shows an error screen with details, reload options, and troubleshooting tips.",
  "frontend/src/components/Footer.tsx": "Renders app footer with build metadata, branding, export button, and external attribution links.",
  "frontend/src/components/Header.tsx": "Renders the top navigation header with app branding, wallet connect, and a theme toggle button.",
  "frontend/src/components/TokenSelectorInput.tsx": "Provides a token input and selector UI with search, manual entry mode, metadata display, and token management actions.",
  "frontend/src/components/TransactionHistory.tsx": "Displays transaction history with status indicators, selection controls, deletion, and sharing support for WhatsApp and Telegram.",
  "frontend/src/components/VaultBalancesTable.tsx": "Shows vault token balances, BNB valuation, token valuations, and error states for missing or failed token data.",
  "frontend/src/components/WalletBalancesTable.tsx": "Displays connected wallet token balances with valuations and token labels derived from the saved catalog.",
  "frontend/src/components/WalletBalancesView.tsx": "Wraps wallet balance loading, refresh controls, live update toggling, and renders the wallet balances table.",
  "frontend/src/components/WalletConnect.tsx": "UI component managing wallet connection, network switching, and mobile-specific MetaMask instructions using useWeb3.",
  "frontend/src/components/WalletConnectTopBar.tsx": "Top-bar wallet status component showing connection, network state, and actions for connecting or switching to BSC.",
  "frontend/src/components/WithdrawalDestinationSelector.tsx": "Selector allowing users to choose owner or custom withdrawal address with validation.",
  "frontend/src/components/WithdrawForm.tsx": "Form for withdrawing BNB or tokens with validation, transaction handling, and history logging.",
  "frontend/src/global.d.ts": "Type definitions extending window.ethereum for EVM wallet interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches and calculates USD and BNB valuations for BNB and token balances with loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and state management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file exporting nothing.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a persistent token label catalog in localStorage, including seeding defaults, upserting labels, and generating fallback names.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata in localStorage with versioning, providing get/set/clear operations.",
  "frontend/src/hooks/useTxHistory.ts": "Stores and updates transaction history in localStorage and polls for receipt confirmations via provider or RPC.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches BNB and token balances using contract calls with fallbacks, tracks metadata, live updates, and error states.",
  "frontend/src/hooks/useVaultInfo.ts": "Fetches and exposes the vault owner address via a contract call with loading and error states.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal operations for the vault, handling approvals, transactions, and state flags.",
  "frontend/src/hooks/useWalletBalances.ts": "Fetches BNB and watched ERC20 token balances for the connected BSC wallet with caching, polling control, and error handling.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a persistent list of validated token addresses with localStorage syncing and add/remove utilities.",
  "frontend/src/hooks/useWeb3.tsx": "Provides Web3 context for wallet connection, chain switching, contract calls, and native balance retrieval.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and color variables for light and dark themes.",
  "frontend/src/lib/appBranding.ts": "Stores app branding constants and helpers for names, identifiers, and tagline.",
  "frontend/src/lib/buildExport.ts": "Creates a downloadable ZIP of project sources by gathering backend, frontend, and config files.",
  "frontend/src/lib/buildInfo.ts": "Exposes build version, date, and identifier from environment variables with a fallback lookup.",
  "frontend/src/lib/contracts.ts": "Contains contract method signatures and utilities to encode and decode EVM contract calls.",
  "frontend/src/lib/defaultBscTokens.ts": "Lists default BSC token addresses and labels used to seed the watched token list.",
  "frontend/src/lib/evm.ts": "Provides BigInt-based EVM encoding/decoding utilities and address/units helpers without ethers.js.",
  "frontend/src/lib/evmAbiText.ts": "Decodes ABI-encoded strings and ERC‑20 metadata in a browser-safe way using TextDecoder.",
  "frontend/src/lib/exportSourceManifest.ts": "Collects deterministic backend and frontend source files and generates an export README.",
  "frontend/src/lib/performanceCheck.ts": "Gathers build and browser performance timing data and formats it for display or clipboard export.",
  "frontend/src/lib/prices.ts": "Fetches BNB and known token prices from CoinGecko and formats numeric price output.",
  "frontend/src/lib/tokenDisplay.ts": "Generates consistent token display labels with fallbacks and address shortening utilities.",
  "frontend/src/lib/txHistoryShare.ts": "Formats transaction history entries for sharing and builds share URLs for WhatsApp and Telegram.",
  "frontend/src/lib/utils.ts": "Provides a Tailwind‑aware class name merge helper.",
  "frontend/src/lib/zipCrc32.ts": "Implements a CRC32 checksum generator using a lookup table for ZIP creation.",
  "frontend/src/lib/zipWriter.ts": "Implements an in-browser ZIP writer that builds uncompressed ZIP files with correct headers and CRC32 checksums.",
  "frontend/src/main.tsx": "Application entry rendering the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard UI handling wallet connection state, BSC network checks, balances, and deposit/withdraw operations.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and content paths for the frontend.",
  "project_state.json": "Describes the project’s state, features, and requirements for implementing ZIP export and regeneration logic."
}