{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping features to touched files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend source files used in build planning.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme CSS variables and base element styling.",
  "frontend/index.html": "Main HTML shell including boot fallback UI, metadata tags, and build ID for runtime diagnostics.",
  "frontend/public/health.html": "Static no-JavaScript health check page showing build ID and connectivity guidance.",
  "frontend/src/App.tsx": "Root React component wiring ThemeProvider, Web3 provider, ErrorBoundary, and dispatching an app-mounted event.",
  "frontend/src/components/BalanceView.tsx": "Component displaying BNB and token balances with refresh, live updates toggle, cache clearing, and valuation support.",
  "frontend/src/components/ContractInfo.tsx": "Displays contract address, owner, and network info with copy-to-clipboard and BscScan link features.",
  "frontend/src/components/DepositForm.tsx": "Handles depositing tokens into the vault, including token selection, validation, balance display, and transaction history integration.",
  "frontend/src/components/DiagnosticsBar.tsx": "Shows build and environment metadata and provides buttons to copy diagnostics and performance data to the clipboard.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches runtime React errors and displays a recovery UI with error details and a reload option.",
  "frontend/src/components/Footer.tsx": "Renders the application footer with build info, branding, and external link attribution.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding and a theme toggle button.",
  "frontend/src/components/TokenSelectorInput.tsx": "Provides a token selection input with dropdown options or manual entry, including validation and UI switching modes.",
  "frontend/src/components/TransactionHistory.tsx": "Displays local transaction history with status badges, hash/address shortening, BscScan links, and a clear-history action.",
  "frontend/src/components/WalletConnect.tsx": "Handles wallet connection flow, network switching, and mobile/desktop fallback instructions for MetaMask and other EVM wallets.",
  "frontend/src/components/WithdrawForm.tsx": "Provides UI and logic for withdrawing BNB or tokens, validating inputs, executing withdrawals, and logging transactions.",
  "frontend/src/global.d.ts": "Extends the Window type with Ethereum provider fields for MetaMask compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous Internet Computer actor, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBalanceValuations.ts": "Fetches BNB and token prices, computes USD/BNB valuations, and tracks loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, stored identities, and provides related context to the app.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating Web3 replaces backend queries.",
  "frontend/src/hooks/useSavedTokenCatalog.ts": "Manages a localStorage-backed map of token addresses to labels, providing add/update/remove operations and fallback labels.",
  "frontend/src/hooks/useTokenMetadataCache.ts": "Caches token metadata in localStorage with versioning to reduce repeated RPC calls.",
  "frontend/src/hooks/useTxHistory.ts": "Stores and updates transaction history in localStorage and polls for status updates via provider or RPC.",
  "frontend/src/hooks/useVaultBalances.ts": "Fetches and caches BNB and token balances from the vault, including token metadata and periodic polling.",
  "frontend/src/hooks/useVaultInfo.ts": "Retrieves and exposes the vault owner's address with loading and error states.",
  "frontend/src/hooks/useVaultOperations.ts": "Provides deposit and withdrawal operations for BNB and tokens using encoded contract calls.",
  "frontend/src/hooks/useWatchedTokens.ts": "Manages a normalized, validated list of watched token addresses persisted to localStorage.",
  "frontend/src/hooks/useWeb3.tsx": "Provides a React context for Web3 wallet state, connection, chain switching, contract calls, and error handling with MetaMask and BSC support.",
  "frontend/src/index.css": "Tailwind CSS base and theme variables defining light/dark color palettes, accessibility styles, and mobile touch utilities.",
  "frontend/src/lib/buildInfo.ts": "Exports build metadata and helpers to retrieve build identifier, version, date, and deployed build ID from a meta tag.",
  "frontend/src/lib/contracts.ts": "Defines contract addresses and call encoders/decoders for EVM methods, including parameter encoding and result parsing.",
  "frontend/src/lib/evm.ts": "Contains low-level EVM helpers for encoding/decoding uint256 and addresses, plus unit parsing/formatting utilities.",
  "frontend/src/lib/evmAbiText.ts": "Implements browser-friendly decoding of ABI-encoded strings and ERC‑20 metadata such as symbol and name.",
  "frontend/src/lib/performanceCheck.ts": "Collects build and browser performance metrics and formats them into a readable text report.",
  "frontend/src/lib/prices.ts": "Fetches BNB and token prices from CoinGecko and provides formatting and token mapping utilities.",
  "frontend/src/lib/utils.ts": "Exports a class name merge helper combining clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global CSS.",
  "frontend/src/pages/Dashboard.tsx": "React dashboard page that manages Web3 connection state, displays vault balances, and provides deposit/withdraw operations using tabs and various UI components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for animations and typography.",
  "project_state.json": "JSON file describing the project’s state, known issues, and existing feature requirements for deployment stability and diagnostics improvements."
}