{
  "kind": "build_request",
  "title": "Fix wallet connect visibility and vault balance refresh after connect",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the wallet connection UI is reliably shown on the Dashboard whenever the user is not connected, Web3 is still initializing, or the connected wallet is on a non-BSC network (chainId != 56). This must prevent states where the user cannot see a visible \"Connect Wallet\" / \"Wrong Network\" prompt due to initialization timing or stale Web3 state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Connect wallet and vault balance refresh issue still exist"
        ]
      },
      "acceptanceCriteria": [
        "With MetaMask installed and no account connected, the Dashboard renders the WalletConnect UI with a \"Connect Wallet\" button.",
        "While Web3 is initializing (e.g., initial page load before eth_accounts/eth_chainId resolve), the Dashboard shows the WalletConnect area (or a clear loading state in the same area) rather than hiding it.",
        "When an account is connected but chainId != 56, the Dashboard renders the WalletConnect UI in \"Wrong Network\" mode and does not render the balances/operations panels.",
        "When the user switches back to chainId 56, the balances/operations panels become available without requiring a hard refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix vault balance refresh so that it always completes (success or error) and reliably updates balances after wallet connect, account change, chain change, and manual refresh clicks. Manual refresh must not no-op due to an in-flight polling fetch; it should either (a) await the in-flight fetch and then run a new fetch, or (b) coalesce into a single fetch that updates state and resolves the refresh call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Connect wallet and vault balance refresh issue still exist"
        ]
      },
      "acceptanceCriteria": [
        "After clicking \"Connect Wallet\" (on BSC chainId 56), Vault Balances load and display without requiring a page reload.",
        "Clicking the \"Refresh\" button in BalanceView always results in either (a) updated balances and \"Last updated\" time changing, or (b) a clear error message—never an indefinite spinner.",
        "If polling is enabled and a poll fetch is currently in progress, clicking manual Refresh still results in a completed refresh sequence (it must not return immediately without updating).",
        "When accounts are changed in the wallet, balances refresh for the new context and the UI does not get stuck in loading/refreshing state.",
        "When chain is changed away from BSC and back to BSC, balances recover and can be refreshed successfully."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve Web3 provider event handling to keep account/chainId state in sync with the wallet provider and reduce stale states that can hide the connect UI or block refresh flows. Include handling for relevant EIP-1193 events (at minimum: accountsChanged, chainChanged, connect, disconnect) and ensure state is reset/updated consistently on each event.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Connect wallet and vault balance refresh issue still exist"
        ]
      },
      "acceptanceCriteria": [
        "If the wallet disconnects or the user removes all accounts, the app returns to the WalletConnect screen (\"Connect Wallet\" visible).",
        "If the wallet reconnects (provider emits connect) the app updates chainId and shows the correct WalletConnect mode (connected-on-wrong-network vs ready).",
        "No console errors are thrown due to event listener cleanup or missing handlers when navigating/reloading the app."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor; no new backend services or external databases."
  ],
  "nonGoals": [
    "Adding new authentication methods (only existing wallet connection behavior should be fixed).",
    "Adding new vault features (deposits/withdrawals logic changes) beyond what is necessary to fix connect/refresh reliability.",
    "Adding real-time features (WebSockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}