{
  "kind": "build_request",
  "title": "Stabilize live balance fetching, move Wallet Connect to top, and show token-wise vault balances",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the live vault balance data-fetch/polling so it does not trigger repeated refresh loops and does not prevent the Wallet Connect UI from being shown when needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I think you have added live data fatch from bsc scan vo theek se kaam nahi kar rha hia isliye baar baar refresh ho rha isi liye wallet connect bhi show nahi ho rhai"
        ]
      },
      "acceptanceCriteria": [
        "With live updates enabled, the UI does not continually re-render/refresh the page in a loop.",
        "Polling/refreshing balances does not cause the Wallet Connect UI to disappear when the user is not connected or is on the wrong network.",
        "If balance fetch fails (timeouts/RPC errors), the app shows an error state but remains usable (no refresh loop), and the user can manually retry refresh.",
        "Manual refresh and polling are coalesced so multiple overlapping fetches do not cascade into repeated state resets."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Move the Wallet Connect entry point to the top of the screen so users can always see a Wallet Connect button in the top area (above the hero/content), regardless of balance refresh behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "aisa karo wallet connect button top per rakho"
        ]
      },
      "acceptanceCriteria": [
        "A Wallet Connect button is visible at the top of the Dashboard layout when the user is not connected (and/or is initializing / wrong network).",
        "The Wallet Connect UI remains accessible without requiring the user to scroll.",
        "When connected, the top area no longer shows a primary “Connect Wallet” call-to-action (it may show connection status instead)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the vault balances display to be explicitly token-wise: show a clear list/table where each row is a token label (BNB plus other tokens) with its balance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "uske baad vault balance token wise jisme bnb, and other token likha ho"
        ]
      },
      "acceptanceCriteria": [
        "The balances UI clearly presents BNB as a token row and displays other tokens as separate rows with their token labels (symbol) and balances.",
        "If there are no tokens to display beyond BNB, the UI communicates that clearly (without hiding the token-wise structure).",
        "Token rows remain readable during refresh (no flicker that looks like page refresh)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components); compose them instead.",
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing third-party authentication or non-Internet-Identity auth.",
    "Adding a new backend database or external database integration.",
    "Adding real-time WebSocket-based updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}