{
  "kind": "build_request",
  "title": "Update branding to “Digital Asset Vault” and add deposit/withdrawal transaction history with status",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the app’s primary branding copy to remove the subtitle “Professional-grade asset management on Binance Smart Chain” and replace the main title with “Digital Asset Vault”. Ensure the header brand text also uses “Digital Asset Vault” (with a sensible short/mobile variant if needed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please remove title Professional grade asset management on Binance Smart and write Digital Asset Vault"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard welcome section, the main title displays exactly “Digital Asset Vault”.",
        "The subtitle text “Professional-grade asset management on Binance Smart Chain” is no longer shown anywhere in the welcome/hero area.",
        "In the Header, the brand text displays “Digital Asset Vault” (and does not display “Vault Dashboard”).",
        "All user-facing copy changes are in English and do not introduce new non-English strings."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add a Deposit/Withdrawal History UI that shows a list of deposits and withdrawals initiated from this dApp, including each item’s current status (e.g., Pending, Confirmed, Failed) and key details (type, token/BNB, amount, time, tx hash). The history must be accessible via a clearly labeled “Deposit & Withdrawal History” button/section associated with the Deposit and Withdraw areas (so users can check the status after submitting).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also show deposit and withdrawal history state in deposit /withdrawal history button"
        ]
      },
      "acceptanceCriteria": [
        "After a successful submission of a deposit or withdrawal transaction from this dApp, an entry is added to a local history list.",
        "Each history entry shows: operation type (Deposit Token / Withdraw BNB / Withdraw Token), asset (BNB or token address/label if available), amount (as entered), timestamp, and transaction hash (shortened display is OK).",
        "Each history entry displays a status that updates over time: Pending until confirmed, then Confirmed; if the transaction fails/reverts, status becomes Failed.",
        "History is visible from the Deposit and Withdraw flows via a clearly labeled control such as “Deposit & Withdrawal History”.",
        "History persists across page refreshes (e.g., stored locally in the browser)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Provide basic history management actions in the Deposit/Withdrawal History UI: allow users to clear the history and allow users to open each transaction in a block explorer (BscScan) from the transaction hash link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "show deposit and withdrawal history state in deposit /withdrawal history button"
        ]
      },
      "acceptanceCriteria": [
        "A “Clear History” action is available and removes all locally stored history entries after user confirmation (or an equivalent safe UX).",
        "Each history item includes a link that opens the transaction on BscScan in a new tab/window.",
        "Clearing history does not affect balances, watched tokens, or saved token catalog state."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (compose them instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not implement a full on-chain indexed history for all vault activity; only track and display transactions initiated from this dApp (stored locally).",
    "Do not add new backend persistence for history (no Motoko canister storage required for this feature unless explicitly requested later).",
    "Do not add real-time WebSocket-based updates for transaction status."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}