{
  "kind": "build_request",
  "title": "Stabilize deployment loading and add a simple reachability/performance self-check (rollback v14)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a static, no-JavaScript reachability check page that can be loaded directly (e.g., `/health.html`) and displays the current build identifier (from the existing build ID metadata) so the user can distinguish DNS/hosting failures from in-app runtime failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "Please check it properly its vaisting my time",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "A new static asset is available at a stable path (e.g., `/health.html`) and loads without requiring the React app to boot.",
        "The health page includes plain English text and shows the current build identifier (e.g., `rollback-v14-2026-02-13`).",
        "If the main app URL fails to load but `/health.html` loads, the user can clearly tell it is an app boot issue rather than DNS/host resolution."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a user-accessible “Performance check” section to the existing in-app diagnostics UI that reports basic page-load timing (e.g., time-to-app-mounted using the existing `app-mounted` signal, plus browser navigation timing when available) and includes a one-click copy-to-clipboard output for support/debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "Please check it properly its vaisting my time",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "After the app loads, the Diagnostics area shows a clearly labeled “Performance check” section in English.",
        "The performance check displays at least: deployed build ID, timestamp, and a measured time from initial navigation to the `app-mounted` event (in ms or s).",
        "There is a “Copy” action that copies the performance data to clipboard in a readable text block."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the boot fallback screen user-facing text remains clear and consistent for the three failure modes it already detects (resource/script load failure, network/connection issue, runtime error), and includes the build identifier in all non-success states so the user can report exactly what they saw.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "Please check it properly its vaisting my time",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When the app is still loading, times out, or fails due to a resource/network/runtime error, the boot fallback UI includes the build identifier visibly.",
        "The fallback messages are in plain English and do not require the user to open developer tools to identify the error category and build ID.",
        "On successful load, the boot fallback hides as it does now (triggered by `app-mounted` or root mutation)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and `frontend/src/components/ui` are immutable and must not be modified.",
    "Do not introduce additional backend services or external databases; keep changes within the existing single-frontend deployment model."
  ],
  "nonGoals": [
    "Do not add new vault features (deposit/withdraw logic, token watchlist behavior, pricing, etc.) beyond diagnostics/reachability checks.",
    "Do not implement third-party monitoring, analytics, or external logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}