{
  "kind": "build_request",
  "title": "Remove ZIP build export from the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the ZIP build export feature from the UI by deleting the \"Build Export\" section in the Diagnostics bar, including the download button, progress text, and the deployment instructions that reference downloading/extracting a ZIP.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "pls remove zip file from it"
        ]
      },
      "acceptanceCriteria": [
        "In the Diagnostics bar, there is no \"Build Export\" card/section visible.",
        "No user-facing text anywhere in the app mentions downloading a ZIP, extracting a ZIP, or \"Download Frontend Build (ZIP)\".",
        "The rest of the Diagnostics bar (build info, copy diagnostics, performance check) still renders and functions as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the underlying ZIP export implementation so the frontend no longer generates or downloads ZIP files, including removing the usage of exportFrontendBuild/downloadBlob and any ZIP writer logic that is only used for this export.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "pls remove zip file from it"
        ]
      },
      "acceptanceCriteria": [
        "The frontend codebase has no runtime path that generates a .zip Blob for build export.",
        "DiagnosticsBar no longer imports or references ZIP-export-related functions/modules (e.g., '@/lib/buildExport').",
        "The application builds successfully with no unused/invalid imports after removing ZIP export code paths."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only components must be composed, not edited).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain single-actor; do not add additional backend services."
  ],
  "nonGoals": [
    "Do not add an alternative build/export mechanism (e.g., TAR, direct file listing, external hosting integrations) unless explicitly requested.",
    "Do not change wallet connection, balance fetching, vault operations, or other dashboard features beyond removing ZIP export references."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}