{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reachability health page + in-app performance check + clearer boot fallback (rollback v14)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a static no-JavaScript reachability page at a stable path that displays the current build identifier.",
      "acceptanceCriteria": [
        "A new static asset is available at a stable path (e.g., `/health.html`) and loads without requiring the React app to boot.",
        "The health page includes plain English text and shows the current build identifier (e.g., `rollback-v14-2026-02-13`).",
        "If the main app URL fails to load but `/health.html` loads, the user can clearly tell it is an app boot issue rather than DNS/host resolution."
      ],
      "file_operations": [
        {
          "path": "frontend/public/health.html",
          "operation": "create",
          "description": "Create a fully static HTML page (no JavaScript required) at /health.html that includes plain-English reachability guidance and renders the current build identifier consistent with frontend/index.html meta build-id (e.g., rollback-v14-2026-02-13)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a user-accessible Performance check section in the in-app diagnostics UI with timing metrics and copy-to-clipboard support.",
      "acceptanceCriteria": [
        "After the app loads, the Diagnostics area shows a clearly labeled “Performance check” section in English.",
        "The performance check displays at least: deployed build ID, timestamp, and a measured time from initial navigation to the `app-mounted` event (in ms or s).",
        "There is a “Copy” action that copies the performance data to clipboard in a readable text block."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Extend the existing boot script to record a durable performance measurement for time-to-app-mounted using the existing app-mounted signal (e.g., store a window-scoped value captured when the app-mounted event fires) so the React UI can display it later without races."
        },
        {
          "path": "frontend/src/lib/performanceCheck.ts",
          "operation": "create",
          "description": "Add a small helper to assemble performance-check data (build ID via existing buildInfo helpers, timestamp, time-to-app-mounted from the window-scoped value set in frontend/index.html, and browser navigation timing when available) into a readable text block for display/copy."
        },
        {
          "path": "frontend/src/components/DiagnosticsBar.tsx",
          "operation": "modify",
          "description": "Update the existing diagnostics UI to include a clearly labeled “Performance check” section and a one-click copy-to-clipboard action for the performance output. Use existing shadcn-ui components (e.g., Button/Badge/Card/Alert as already available) to present the section consistently; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep boot fallback messaging clear/consistent across existing failure modes and include build identifier in all non-success states.",
      "acceptanceCriteria": [
        "When the app is still loading, times out, or fails due to a resource/network/runtime error, the boot fallback UI includes the build identifier visibly.",
        "The fallback messages are in plain English and do not require the user to open developer tools to identify the error category and build ID.",
        "On successful load, the boot fallback hides as it does now (triggered by `app-mounted` or root mutation)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Adjust the boot fallback UI text so it remains plain-English and consistent for the three existing failure modes (resource/script load failure, network/connection issue, runtime error), and ensure the build identifier is visible in every non-success state including the initial loading state (not only after the still-loading threshold). Keep the existing success behavior where the fallback hides on app-mounted/root mutation."
        }
      ]
    }
  ]
}