{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Dashboard wrong-network wallet UI visibility and stop Vault Balances infinite refresh spinner",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Show WalletConnect on Dashboard when disconnected or on the wrong network (chainId != 56) and hide balance/operations panels until on BSC.",
      "acceptanceCriteria": [
        "If no wallet is connected, the Dashboard shows the WalletConnect card with a visible \"Connect Wallet\" button.",
        "If a wallet is connected but chainId is not 56, the Dashboard shows the WalletConnect \"Wrong Network\" UI (including the \"Switch to BSC Network\" button) and does not show the balances/operations panels.",
        "If a wallet is connected and chainId is 56, the WalletConnect UI is hidden and the balances/operations panels render as normal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update the Dashboard conditional rendering so the existing WalletConnect component is rendered when (a) no account is connected OR (b) an account is connected but chainId !== 56, and gate the balances + vault operations UI to only render when chainId === 56. Add a clear, user-facing message (e.g., Alert) in the wrong-network state explaining that balances/operations are unavailable until switching to BSC."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make Vault Balances refresh/polling bounded and error-driven: skip on wrong network, enforce timeouts, and ensure isRefreshing cannot remain true indefinitely.",
      "acceptanceCriteria": [
        "When chainId != 56, Vault Balances does not poll/refresh and shows an English error message instructing the user to switch to BSC (no infinite spinner).",
        "When clicking Refresh, the button spinner stops within a bounded time even if the RPC endpoint is slow/unresponsive, and an error alert is shown if the fetch fails/timeouts.",
        "During auto-polling, overlapping fetches do not cause the UI to remain in a refreshing state; `isRefreshing` reliably returns to false after completion or failure.",
        "If balance calls revert or return invalid data, the UI shows an error alert instead of silently showing no balances while continuing to spin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVaultBalances.ts",
          "operation": "modify",
          "description": "Add chain gating using chainId from useWeb3 so balance fetching is skipped (and polling disabled) when chainId !== 56, setting a clear English error message and ensuring isLoading/isRefreshing are reset. Add a timeout wrapper around contract/RPC calls so stalled requests resolve into an error state within a bounded time and always release the in-flight/refresh flags in finally blocks. Improve token-balance fetching to surface per-token or aggregate errors (reverts/invalid data) into the hook's error state so the UI shows an error alert instead of silently dropping balances while appearing to refresh."
        }
      ]
    }
  ]
}