{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove ZIP build export from the app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Diagnostics bar \"Build Export\" UI card/section and all ZIP-related user-facing copy while keeping other diagnostics features unchanged.",
      "acceptanceCriteria": [
        "In the Diagnostics bar, there is no \"Build Export\" card/section visible.",
        "No user-facing text anywhere in the app mentions downloading a ZIP, extracting a ZIP, or \"Download Frontend Build (ZIP)\".",
        "The rest of the Diagnostics bar (build info, copy diagnostics, performance check) still renders and functions as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiagnosticsBar.tsx",
          "operation": "modify",
          "description": "Delete the entire \"Build Export\" Card section (download button, progress text, and deployment instructions) from the Diagnostics bar UI. Remove related React state, handlers, icons, and imports (including exportFrontendBuild/downloadBlob) so the remaining Diagnostics bar sections continue to render and function as before."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the ZIP export implementation and any ZIP-only logic so the frontend can no longer generate or download ZIP files.",
      "acceptanceCriteria": [
        "The frontend codebase has no runtime path that generates a .zip Blob for build export.",
        "DiagnosticsBar no longer imports or references ZIP-export-related functions/modules (e.g., '@/lib/buildExport').",
        "The application builds successfully with no unused/invalid imports after removing ZIP export code paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/buildExport.ts",
          "operation": "delete",
          "description": "Remove the build export module that fetches app assets and assembles a ZIP Blob for download (including the download helper), since it is only used for ZIP export."
        },
        {
          "path": "frontend/src/lib/zipWriter.ts",
          "operation": "delete",
          "description": "Remove the in-browser ZIP writer implementation that exists solely to support the build export ZIP creation path."
        },
        {
          "path": "frontend/src/components/DiagnosticsBar.tsx",
          "operation": "modify",
          "description": "After removing the ZIP-export UI, ensure all ZIP-export-related imports/references are removed (e.g., '@/lib/buildExport') so there is no remaining runtime path that can generate or download ZIP files, and the app compiles cleanly without unused imports."
        }
      ]
    }
  ]
}