{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Digital Asset Vault branding update + local deposit/withdrawal transaction history",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Update primary branding copy to “Digital Asset Vault” in the Dashboard welcome section and Header, and remove the old subtitle.",
      "acceptanceCriteria": [
        "On the Dashboard welcome section, the main title displays exactly “Digital Asset Vault”.",
        "The subtitle text “Professional-grade asset management on Binance Smart Chain” is no longer shown anywhere in the welcome/hero area.",
        "In the Header, the brand text displays “Digital Asset Vault” (and does not display “Vault Dashboard”).",
        "All user-facing copy changes are in English and do not introduce new non-English strings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update the welcome/hero copy: replace the main title with exactly “Digital Asset Vault” and remove the subtitle string. Ensure no leftover rendering of the removed subtitle remains. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update header branding text to “Digital Asset Vault” and adjust the short/mobile variant to a sensible abbreviated label that is not “Vault Dashboard”. Remove/adjust any secondary tagline if it conflicts with the new branding. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Align document title and boot fallback loading copy with the new primary branding (“Digital Asset Vault”) while keeping all user-facing text in English. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add a local, persistent Deposit/Withdrawal History UI with status tracking (Pending/Confirmed/Failed), accessible from Deposit and Withdraw flows via a clearly labeled control.",
      "acceptanceCriteria": [
        "After a successful submission of a deposit or withdrawal transaction from this dApp, an entry is added to a local history list.",
        "Each history entry shows: operation type (Deposit Token / Withdraw BNB / Withdraw Token), asset (BNB or token address/label if available), amount (as entered), timestamp, and transaction hash (shortened display is OK).",
        "Each history entry displays a status that updates over time: Pending until confirmed, then Confirmed; if the transaction fails/reverts, status becomes Failed.",
        "History is visible from the Deposit and Withdraw flows via a clearly labeled control such as “Deposit & Withdrawal History”.",
        "History persists across page refreshes (e.g., stored locally in the browser)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTxHistory.ts",
          "operation": "create",
          "description": "Create a localStorage-backed transaction history hook for transactions initiated by this dApp. It should support adding entries (type, asset, amount, timestamp, tx hash) and polling for receipt updates to transition status from Pending to Confirmed/Failed (no WebSockets). (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/TransactionHistory.tsx",
          "operation": "create",
          "description": "Create a reusable TransactionHistory UI component that renders the locally stored history list with columns/rows for type, asset, amount, time, tx hash (short display), and status (Pending/Confirmed/Failed). Use existing shadcn-ui primitives already in the app (e.g., Card, Button, Alert) without editing any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useVaultOperations.ts",
          "operation": "modify",
          "description": "Update vault operation helpers to return the transaction hash string from wallet submission for deposit/withdraw actions so the UI can add entries to local history immediately after submission. Keep behavior otherwise consistent. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/DepositForm.tsx",
          "operation": "modify",
          "description": "Wire transaction history into the deposit flow: after a successful deposit submission (vault deposit transaction), add an entry to local history with type “Deposit Token”, asset token address/label if available, amount, timestamp, and tx hash. Add a clearly labeled control “Deposit & Withdrawal History” associated with the Deposit UI that toggles/displays the TransactionHistory component. Use existing shadcn-ui Button/Card primitives; do not modify frontend/src/components/ui files. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/WithdrawForm.tsx",
          "operation": "modify",
          "description": "Wire transaction history into the withdraw flows: after successful submission, add entries for “Withdraw BNB” and “Withdraw Token” with asset (BNB or token address/label), amount, timestamp, and tx hash. Add a clearly labeled “Deposit & Withdrawal History” control associated with the Withdraw UI that toggles/displays the TransactionHistory component. Use existing shadcn-ui primitives; do not modify frontend/src/components/ui files. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add history management actions: clear history (with confirmation) and BscScan links per transaction.",
      "acceptanceCriteria": [
        "A “Clear History” action is available and removes all locally stored history entries after user confirmation (or an equivalent safe UX).",
        "Each history item includes a link that opens the transaction on BscScan in a new tab/window.",
        "Clearing history does not affect balances, watched tokens, or saved token catalog state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTxHistory.ts",
          "operation": "modify",
          "description": "Add history management methods to the history hook: clear-all (history only), and helpers for building a BscScan transaction URL from tx hash. Ensure the localStorage key used is isolated to history so clearing does not touch balances, watched tokens, or token catalog state. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/TransactionHistory.tsx",
          "operation": "modify",
          "description": "Add UI actions: a “Clear History” button with a confirmation step (e.g., native confirm or safe UX using existing primitives) and a per-item tx hash link that opens the transaction on BscScan in a new tab/window. Ensure link uses rel=\"noopener noreferrer\". Use existing shadcn-ui Button/Alert/Card primitives; do not modify frontend/src/components/ui files. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DepositForm.tsx",
          "operation": "modify",
          "description": "Ensure the embedded/toggled TransactionHistory view within Deposit exposes the clear-history action and BscScan links (via the shared TransactionHistory component), without impacting any other locally stored state. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/WithdrawForm.tsx",
          "operation": "modify",
          "description": "Ensure the embedded/toggled TransactionHistory view within Withdraw exposes the clear-history action and BscScan links (via the shared TransactionHistory component), without impacting any other locally stored state. (Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}